Update Product Brief
